In [339]:
import pandas as pd

### Загрузить датасет с помощью библиотеки pandas.

In [342]:
df = pd.read_csv('credit_risk.csv')

Датасет был загружен с помощью использования библиотеки pandas и метода pf.read_csv() в переменную df.

### Вывести первые 20 строк с помощью метода head.

In [346]:
df.head(20)

,Id,Age,Income,Home,Emp_length,Intent,Amount,Rate,Status,Percent_income,Default,Cred_length
0,0,22.0,59000,RENT,123.0,PERSONAL,35000,16.02,1,0.59,Y,3
1,1,21.0,9600,OWN,5.0,EDUCATION,1000,11.14,0,0.10,N,2
2,2,25.0,9600,MORTGAGE,1.0,MEDICAL,5500,12.87,1,0.57,N,3
3,3,23.0,65500,RENT,4.0,MEDICAL,35000,15.23,1,0.53,N,2
4,4,24.0,54400,RENT,8.0,MEDICAL,35000,14.27,1,0.55,Y,4
5,5,21.0,9900,OWN,2.0,VENTURE,2500,7.14,1,0.25,N,2
6,6,26.0,77100,RENET,8.0,EDUCATION,35000,12.42,1,0.45,N,3
7,7,24.0,78956,RENT,5.0,MEDICAL,35000,11.11,1,0.44,N,4
8,8,24.0,83000,RENT,8.0,PERSONAL,35000,8.90,1,0.42,N,2
9,9,21.0,10000,OWN,6.0,VENTURE,1600,14.74,1,0.16,N,3
10,10,22.0,85000,RENT,6.0,VENTURE,35000,10.37,1,0.41,N,4
11,11,21.0,10000,OWN,2.0,HOMEIMPROVEMENT,4500,8.63,1,0.45,N,2
12,12,23.0,95000,RENT,2.0,VENTURE,35000,7.90,1,0.37,N,2
13,13,26.0,108160,RENT,4.0,EDUCATION,35000,18.39,1,0.32,N,4
14,14,23.0,115000,RENT,2.0,EDUCATION,35000,7.90,0,0.30,N,4
15,15,23.0,500000,MORTGAGE,7.0,DEBTCONSOLIDATION,30000,10.65,0,0.06,N,3
16,16,23.0,120000,RENT,0.0,EDUCATION,35000,7.90,0,0.29,N,4
17,17,23.0,92111,RENT,7.0,MEDICAL,35000,20.25,1,0.32,N,4
18,18,23.0,113000,RENT,8.0,DEBTCONSOLIDATION,35000,18.25,1,0.31,N,4
19,19,24.0,10800,MORTGAGE,8.0,EDUCATION,1750,10.99,1,0.16,N,2

При помощи метода pandas head(), были выведены первые 20 строк датафрейма.

### Выполнить обзор данных - описать столбцы и вашу предметную область.

Данные содержат информацию о кредитных заявках:
- возраст
- доход
- статус домовладения (Собственный, Ипотека, Аренда)
- стаж работы в годах
- цель кредита
- сумма кредита по заявке
- процентная ставка
- статус одобрения кредита
- сумма кредита в процентах от дохода
- не допустил ли заявитель ранее дефолта по кредиту (да, нет)
- длина кредитной истории заявителя

### С помощью метода info оценить данные (есть ли пропуски, сколько всего строк, какие типы данных у столбцов).

При применении метода info видны пропуски в признаках Emp_lenght и Rate, а также заметно, что тип данных у признака Age является вещественным, хотя все остальные числовые данные являются целочисленными. Всего 652 строк, типом данных у столбцов с текстовыми данными является object.

In [353]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Id              652 non-null    int64
 1   Age             652 non-null    float64
 2   Income          652 non-null    int64
 3   Home            652 non-null    object
 4   Emp_length      643 non-null    float64
 5   Intent          652 non-null    object
 6   Amount          652 non-null    int64
 7   Rate            586 non-null    float64
 8   Status          652 non-null    int64
 9   Percent_income  652 non-null    float64
 10  Default         652 non-null    object
 11  Cred_length     652 non-null    int64
dtypes: float64(4), int64(5), object(3)
memory usage: 61.3+ KB

Тип данных признака Age был заменён на целочисленный.

In [356]:
df['Age'] = df['Age'].astype('int64')

In [358]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 652 entries, 0 to 651
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Id              652 non-null    int64
 1   Age             652 non-null    int64
 2   Income          652 non-null    int64
 3   Home            652 non-null    object
 4   Emp_length      643 non-null    float64
 5   Intent          652 non-null    object
 6   Amount          652 non-null    int64
 7   Rate            586 non-null    float64
 8   Status          652 non-null    int64
 9   Percent_income  652 non-null    float64
 10  Default         652 non-null    object
 11  Cred_length     652 non-null    int64
dtypes: float64(3), int64(6), object(3)
memory usage: 61.3+ KB

### Применить describe . С помощью describe оценить числовые столбцы (если они есть).

In [361]:
df.describe()

,Id,Age,Income,Emp_length,Amount,Rate,Status,Percent_income,Cred_length
count,652.000000,652.000000,652.000000,643.000000,652.000000,586.000000,652.000000,652.000000,652.000000
mean,325.495399,24.285276,90008.855828,4.601866,18800.996933,12.289471,0.601227,0.279831,3.012270
std,188.352535,7.841061,69530.312525,7.281616,9152.896250,3.272772,0.490022,0.150231,0.808843
min,0.000000,21.000000,9600.000000,0.000000,1000.000000,5.420000,0.000000,0.010000,2.000000
25%,162.750000,23.000000,44000.000000,2.000000,10000.000000,10.250000,0.000000,0.160000,2.000000
50%,325.500000,24.000000,69998.000000,4.000000,21850.000000,12.180000,1.000000,0.280000,3.000000
75%,488.250000,25.000000,128499.000000,7.000000,25000.000000,14.720000,1.000000,0.380000,4.000000
max,649.000000,144.000000,500000.000000,123.000000,35000.000000,21.210000,1.000000,0.830000,4.000000

При применении метода describe видно, что значения всех числовых столбцов являются нормальными, тут описано количество числовых записей, среднее значение, стандартное отклонение, минимальное значение, квартили и максимальное значение. Можно заметить аномалию в признаке Age, а именно то, что максимальный возраст равен 144, а медианное значение, а также квартили показывают, что возраст людей в основном находится в диапазоне 24 лет. Проверим последние значения по данному признаку.

In [364]:
df.sort_values(by = 'Age', ascending= False)

,Id,Age,Income,Home,Emp_length,Intent,Amount,Rate,Status,Percent_income,Default,Cred_length
81,81,144,250000,RENT,4.0,VENTURE,4800,13.57,0,0.02,N,3
183,183,144,200000,MORTGAGE,4.0,EDUCATION,6000,11.86,0,0.03,N,2
575,575,123,80004,RENT,2.0,EDUCATION,20400,10.25,0,0.25,N,3
550,550,26,19200,MORTGAGE,5.0,VENTURE,4000,7.51,1,0.21,N,4
563,563,26,97000,RENT,1.0,EDUCATION,21000,7.90,0,0.22,N,3
...,...,...,...,...,...,...,...,...,...,...,...,...
60,60,21,131000,RENT,0.0,VENTURE,30000,5.99,0,0.23,N,4
350,350,21,165000,MORTGAGE,5.0,EDUCATION,20000,6.91,0,0.12,N,4
590,590,21,36000,RENT,5.0,MEDICAL,20000,NaN,1,0.56,Y,2
571,571,21,19500,MORTGAGE,0.0,EDUCATION,15000,9.64,1,0.77,N,2
167,167,21,200000,MORTGAGE,5.0,EDUCATION,16000,14.65,0,0.08,N,4

Заметно, что возраст людей в первых 3 полях является выбросом. Так как 3 поля в сравнении с размером датасета является незначительным, можно принять решение об их удалении.

In [367]:
df = df[df['Age']< 100]

### Вывести на экран названия столбцов с помощью df.columns. Выявить проблемы с названиями, если они есть. При необходимости переименовать столбцы. Если проблемы не обнаружены также дать пояснения.

In [370]:
df.columns

Index(['Id', 'Age', 'Income', 'Home', 'Emp_length', 'Intent', 'Amount', 'Rate',
       'Status', 'Percent_income', 'Default', 'Cred_length'],
      dtype='object')

Проблем с названиями столбцов нет, все признаки соотвествуют описанию.

### Проверить данные на наличие пропусков и устранить их, если они есть (пропуски необходимо либо удалить, либо заменить каким-то значением).

Из предыдущих ячеек были замечены пропуски в признаках Rate и Emp-lenght. Далее будут отображены строки, в которых, в признаке Rate содержатся пустые значения.

In [375]:
df[df['Rate'].isnull()]

,Id,Age,Income,Home,Emp_length,Intent,Amount,Rate,Status,Percent_income,Default,Cred_length
39,39,23,71500,RENT,3.0,DEBTCONSOLIDATION,30000,NaN,1,0.42,N,4
50,50,24,78000,RENT,4.0,DEBTCONSOLIDATION,30000,NaN,1,0.38,Y,4
57,57,23,277000,OWN,3.0,PERSONAL,35000,NaN,0,0.13,N,4
59,59,24,12000,OWN,2.0,VENTURE,1750,NaN,0,0.15,Y,3
62,62,26,263000,MORTGAGE,0.0,EDUCATION,10000,NaN,1,0.04,N,4
...,...,...,...,...,...,...,...,...,...,...,...,...
600,600,24,45000,RENT,8.0,MEDICAL,20000,NaN,1,0.44,N,2
616,616,24,50866,RENT,6.0,MEDICAL,20000,NaN,1,0.39,N,3
628,628,24,52559,RENT,9.0,HOMEIMPROVEMENT,20000,NaN,1,0.38,N,3
642,642,25,55200,RENT,7.0,VENTURE,20000,NaN,1,0.36,N,4
647,647,26,20004,MORTGAGE,4.0,HOMEIMPROVEMENT,3600,NaN,0,0.18,N,2

Данных с пропущенными значениями довольно много, поэтому удалять их не стоит, так как есть риск потерять большую часть данных. В результате выполнения метода describe можно заметить, что минимальное значение не равняется нулю. Так как медиана является является устойчивой к выбросам и в данном датасете примерно является средним значением, то можно заменить все пропуски на нее (медиану).

In [378]:
print('Среднее Rate:', df['Rate'].mean(),'\nМедиана Rate:', df['Rate'].median())
print('Среднее Emp_lenght:', df['Emp_length'].mean(),'\nМедиана Emp_lenght:', df['Emp_length'].median())

Среднее Rate: 12.291509433962263
Медиана Rate: 12.18
Среднее Emp_lenght: 4.6078125
Медиана Emp_lenght: 4.0

In [380]:
df['Rate'] = df['Rate'].fillna(value = df['Rate'].median())

In [382]:
df['Emp_length'] = df['Emp_length'].fillna(value = df['Emp_length'].median())

In [384]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 649 entries, 0 to 651
Data columns (total 12 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Id              649 non-null    int64
 1   Age             649 non-null    int64
 2   Income          649 non-null    int64
 3   Home            649 non-null    object
 4   Emp_length      649 non-null    float64
 5   Intent          649 non-null    object
 6   Amount          649 non-null    int64
 7   Rate            649 non-null    float64
 8   Status          649 non-null    int64
 9   Percent_income  649 non-null    float64
 10  Default         649 non-null    object
 11  Cred_length     649 non-null    int64
dtypes: float64(3), int64(6), object(3)
memory usage: 65.9+ KB

Все пропуски заполнены, датасет подготовлен для дальнейшей работы.

### Проверьте данные на наличие явных и неявных дубликатов. Удалите дубликаты, если они есть.

In [388]:
df[df.duplicated()]

,Id,Age,Income,Home,Emp_length,Intent,Amount,Rate,Status,Percent_income,Default,Cred_length
650,649,23,58800,RENT,7.0,DEBTCONSOLIDATION,20000,7.66,1,0.34,N,3
651,649,23,58800,RENT,7.0,DEBTCONSOLIDATION,20000,7.66,1,0.34,N,3

В результате применения логической индексации к исходному датасету были найдены два явных дубликата. Чтобы избавиться от таких дубликатов используется метод drop_duplicates() , который удаляет строки вместе с индексами.

In [391]:
df.drop_duplicates(inplace=True)
df[df.duplicated()]

Empty DataFrame
Columns: [Id, Age, Income, Home, Emp_length, Intent, Amount, Rate, Status, Percent_income, Default, Cred_length]
Index: []

## Задание 1 Группировка - статус домовладения (home) по количеству дефолтов (default).

In [394]:
df.groupby('Home')['Default'].value_counts()

Home      Default
MORTGAGE  N          106
          Y           29
OTHER     Y            2
OWN       N           85
          Y           13
RENET     N            1
RENT      N          302
          Y          106
          No           3
Name: count, dtype: int64

В результате выполнения групировки были найдены неявные дубликаты, а именно: No и N в признаке Defalut, что означает одно и то же, а также в признаке Home: RENET и RENT. С помощью метода unique было проверено наличие неявных дубликатов в обоих признаках.

In [397]:
df['Default'].unique()

array(['Y', 'N', 'No'], dtype=object)

Наличие неявных дубликатов подтвердилось. Необходимо заменить на корректные значение.

In [400]:
df['Default'] = df['Default'].replace({'No':'N'})
df['Default'].unique()

array(['Y', 'N'], dtype=object)

Аналогично проверим признак Home на наличие неявных дубликатов.

In [403]:
df['Home'].unique()

array(['RENT', 'OWN', 'MORTGAGE', 'RENET', 'OTHER'], dtype=object)

Заменим дубликаты на корректные значения.

In [406]:
df['Home'] = df['Home'].replace({'RENET': 'RENT'})
df['Home'].unique()

array(['RENT', 'OWN', 'MORTGAGE', 'OTHER'], dtype=object)

В итоге получается корректная группировка - статус домовладения (home) по количеству дефолтов (default).

In [409]:
df.groupby('Home')['Default'].value_counts()

Home      Default
MORTGAGE  N          106
          Y           29
OTHER     Y            2
OWN       N           85
          Y           13
RENT      N          306
          Y          106
Name: count, dtype: int64

## Задание 2 Группировка - статус домовладения (home) по количеству дефолтов (default). Создать датафрейм. Переименовать столбец с количеством в “сountˮ. Отсортировать по убыванию столбца “countˮ.

In [412]:
second_task_df = pd.DataFrame(df.groupby(by = 'Home')['Default'].count())
second_task_df

          Default
Home
MORTGAGE      135
OTHER           2
OWN            98
RENT          412

Для преобразования полученной группировки в формат датафрейма был использован объект библиотеки pandas: pd.DataFrame.

In [415]:
second_task_df = second_task_df.rename(columns = {'Default': 'count'})
second_task_df

          count
Home
MORTGAGE    135
OTHER         2
OWN          98
RENT        412

Для переименования столбца, был использован метод pandas: rename, с указанием в параметрах названия новой колонки в формате словаря.

In [418]:
second_task_df.sort_values(by = 'count', ascending = False)

          count
Home
RENT        412
MORTGAGE    135
OWN          98
OTHER         2

В результате применения метода sort_values с указанием в параметрах столбца (by), по которому будет производится сортировка и вида сортировки (ascending = False) - в порядке убывания, значения датафрейма были отсортированы по убыванию столбца "count".

## Задание 3 Сводная таблица (pivot_table) - средняя сумма кредита amount для каждой цели кредита. Отсортировать по убыванию. Округлить до трёх знаков.

Для выполнения третьего задания была создана сводная таблица (pivot_table) из исходного датасета. В параметрах сводной таблицы был указан  index – столбец или столбцы, по которым группируются данные, values – значения, по которым сводная таблица будет создана (в данном случае, сумма кредита) и aggfunc – функция, применяемая к значениям (в данном случае среднее значение).

In [423]:
third_task_df = df.pivot_table(index=['Intent'], values = 'Amount', aggfunc='mean')
third_task_df

                         Amount
Intent
DEBTCONSOLIDATION  19578.186275
EDUCATION          19242.832168
HOMEIMPROVEMENT    17884.558824
MEDICAL            18732.242991
PERSONAL           19350.675676
VENTURE            17844.181034

С помощью метода sort_values данные в таблице были отсортированы по убыванию.

In [426]:
third_task_df = third_task_df.sort_values(by = 'Amount', ascending=False)
third_task_df

                         Amount
Intent
DEBTCONSOLIDATION  19578.186275
PERSONAL           19350.675676
EDUCATION          19242.832168
MEDICAL            18732.242991
HOMEIMPROVEMENT    17884.558824
VENTURE            17844.181034

С помощью метода pandas: apply, к значениям, хранящимся в сводной таблице была применена лямбда функция для округления чисел до трех знаков.

In [429]:
third_task_df['Amount'] = third_task_df['Amount'].apply(lambda x: round(x,3))

Итоговая таблица имеет следующий вид:

In [432]:
third_task_df

                      Amount
Intent
DEBTCONSOLIDATION  19578.186
PERSONAL           19350.676
EDUCATION          19242.832
MEDICAL            18732.243
HOMEIMPROVEMENT    17884.559
VENTURE            17844.181

## Задание 4 Сводная таблица (pivot_table) - средняя сумма кредита amount для каждой цели (intent) - строки и возраста - столбцы . Отсортировать по возрастанию intent. Округлить до двух знаков.

Аналогично третьему заданию, была создана сводная таблица, однако, был добавлен еще один параметр columns, в котором был указан признак "Age".

In [436]:
fourth_task_df = df.pivot_table(index = ['Intent'], columns = 'Age', values = 'Amount', aggfunc = 'mean')
fourth_task_df

Age,21,22,23,24,25,26
Intent,,,,,,
DEBTCONSOLIDATION,9500.000000,18602.777778,20291.666667,20028.571429,18603.333333,21947.222222
EDUCATION,12846.153846,18677.343750,20288.281250,21052.380952,19326.041667,20566.666667
HOMEIMPROVEMENT,4355.000000,10216.666667,4000.000000,19627.678571,21266.666667,20038.461538
MEDICAL,10700.000000,18073.214286,17968.478261,21119.642857,18114.814815,20410.000000
PERSONAL,3633.333333,17735.714286,19241.000000,21205.000000,21738.000000,18588.235294
VENTURE,9407.692308,15515.277778,22810.937500,19406.730769,18360.416667,18850.000000

Далее, был применен метод sort_values, с параметром by = 'Intent' и ascending = True, что означает сортировку по возрастанию по полям Intent.

In [439]:
fourth_task_df = fourth_task_df.sort_values(by = 'Intent', ascending = True)
fourth_task_df

Age,21,22,23,24,25,26
Intent,,,,,,
DEBTCONSOLIDATION,9500.000000,18602.777778,20291.666667,20028.571429,18603.333333,21947.222222
EDUCATION,12846.153846,18677.343750,20288.281250,21052.380952,19326.041667,20566.666667
HOMEIMPROVEMENT,4355.000000,10216.666667,4000.000000,19627.678571,21266.666667,20038.461538
MEDICAL,10700.000000,18073.214286,17968.478261,21119.642857,18114.814815,20410.000000
PERSONAL,3633.333333,17735.714286,19241.000000,21205.000000,21738.000000,18588.235294
VENTURE,9407.692308,15515.277778,22810.937500,19406.730769,18360.416667,18850.000000

Далее, был применен метод apply для округления всех чисел до двух знаков.

In [442]:
fourth_task_df = fourth_task_df.apply(lambda x: round(x,2))

Итоговая таблица имеет следующий вид:

In [445]:
fourth_task_df

Age                      21        22        23        24        25        26
Intent
DEBTCONSOLIDATION   9500.00  18602.78  20291.67  20028.57  18603.33  21947.22
EDUCATION          12846.15  18677.34  20288.28  21052.38  19326.04  20566.67
HOMEIMPROVEMENT     4355.00  10216.67   4000.00  19627.68  21266.67  20038.46
MEDICAL            10700.00  18073.21  17968.48  21119.64  18114.81  20410.00
PERSONAL            3633.33  17735.71  19241.00  21205.00  21738.00  18588.24
VENTURE             9407.69  15515.28  22810.94  19406.73  18360.42  18850.00

In [447]:
fourth_task_df.sum()

Age
21     50442.17
22     98820.99
23    104600.37
24    122440.00
25    117409.27
26    120400.59
dtype: float64

## Вывод
В результате выполнения лабораторной работы была осуществлена предварительная обработа данных csv-файла, выявлены и устранены проблемы в этих данных. Были изучены такие инструменты работы с данными, как библиотека pandas, её возможности и функционал, в частности: загрузка и отображение данных csv-файла, оценка данных при помощи метода info, изменение типов данных, описание числовых столбцов при помощи метода describe, сортировка значений при помощи метода sort_values, проверка значений на пустые при помощи метода isnull, заполнение пропусков при помощи метода fillna, поиск дубликатов при помощи методов duplicated и unique, группировка данных при помощи метода groupby, создание сводных таблиц при помощи метода pivot_table.

Касательно выводов относительно изученных данных, можно утверждать, что: 
- Наименьшее отношение дефолтов наблюдается у тех, у кого собственность в аренде (заявителей с отсутствием долгов в 3 раза больше, чем с их наличием);
- Наибольшее количество заявителей имеет собственность в аренде (414 человека);
- Наибольшая средняя сумма кредитов требуется на погашение долгов (19586.298);
- С повышением возраста увеличивается средняя сумма кредитов (наибольшая сумма кредитов у заявителей 26 лет и составляет 120400.59).